MarlinFirmware/Marlin/buildroot/share/PlatformIO/variants/MARLIN_F103Zx/PeripheralPins.c
#ifdef HAL_SRAM_MODULE_ENABLED
WEAK const PinMap PinMap_FSMC[] = {
  {PD_14,  FSMC_Bank4, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_D00
  {PD_15,  FSMC_Bank4, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_D01
  {PD_0,   FSMC_Bank4, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_D02
  {PD_1,   FSMC_Bank4, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_D03
  {PE_7,   FSMC_Bank4, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_D04
  {PE_8,   FSMC_Bank4, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_D05
  {PE_9,   FSMC_Bank4, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_D06
  {PE_10,  FSMC_Bank4, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_D07
  {PE_11,  FSMC_Bank4, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_D08
  {PE_12,  FSMC_Bank4, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_D09
  {PE_13,  FSMC_Bank4, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_D10
  {PE_14,  FSMC_Bank4, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_D11
  {PE_15,  FSMC_Bank4, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_D12
  {PD_8,   FSMC_Bank4, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_D13
  {PD_9,   FSMC_Bank4, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_D14
  {PD_10,  FSMC_Bank4, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_D15
  {PD_4,   FSMC_Bank4, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_NOE
  {PD_5,   FSMC_Bank4, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_NWE
  {NC,    NP,    0}
};

WEAK const PinMap PinMap_FSMC_CS[] = {
  {PD_7,  (void *)FSMC_BANK1_1, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_NE1
  {PG_9,  (void *)FSMC_BANK1_2, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_NE2
  {PG_10, (void *)FSMC_BANK1_3, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_NE3
  {PG_12, (void *)FSMC_BANK1_4, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_NE4
  {NC,    NP,    0}
};

#define FSMC_RS(A)  (void *)((2 << A) - 2)
WEAK const PinMap PinMap_FSMC_RS[] = {
  {PF_0,  FSMC_RS( 0), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A0
  {PF_1,  FSMC_RS( 1), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A1
  {PF_2,  FSMC_RS( 2), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A2
  {PF_3,  FSMC_RS( 3), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A3
  {PF_4,  FSMC_RS( 4), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A4
  {PF_5,  FSMC_RS( 5), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A5
  {PF_12, FSMC_RS( 6), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A6
  {PF_13, FSMC_RS( 7), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A7
  {PF_14, FSMC_RS( 8), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A8
  {PF_15, FSMC_RS( 9), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A9
  {PG_0,  FSMC_RS(10), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A10
  {PG_1,  FSMC_RS(11), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A11
  {PG_2,  FSMC_RS(12), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A12
  {PG_3,  FSMC_RS(13), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A13
  {PG_4,  FSMC_RS(14), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A14
  {PG_5,  FSMC_RS(15), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A15
  {PD_11, FSMC_RS(16), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A16
  {PD_12, FSMC_RS(17), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A17
  {PD_13, FSMC_RS(18), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A18
  {PE_3,  FSMC_RS(19), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A19
  {PE_4,  FSMC_RS(20), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A20
  {PE_5,  FSMC_RS(21), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A21
  {PE_6,  FSMC_RS(22), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A22
  {PE_2,  FSMC_RS(23), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A23
  {PG_13, FSMC_RS(24), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A24
  {PG_14, FSMC_RS(25), STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, AFIO_NONE)}, // FSMC_A25
  {NC,    NP,    0}
};
#endif